Documents/ПриемкаГорныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриемкаГорныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГорныеРаботы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ГорныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическиВыполнено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГорныеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГорныеРаботы</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПоПлану</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриемкаГорныхРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГорныеРаботыПриИзменении(Элемент)
	// Очищаем табличную часть перед заполнением
    Объект.Работы.Очистить();
    
    СсылкаГорныеРаботы = Объект.ГорныеРаботы;
    Если Не ЗначениеЗаполнено(СсылкаГорныеРаботы) Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем данные горных работ с сервера
    ДанныеГорныхРабот = ПолучитьДанныеГорныхРабот(СсылкаГорныеРаботы);
    Если ДанныеГорныхРабот = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Заполняем табличную часть данными из горных работ
    Для Каждого СтрокаГорныхРабот Из ДанныеГорныхРабот Цикл
        НоваяСтрока = Объект.Работы.Добавить();
        НоваяСтрока.ВремяНачала = СтрокаГорныхРабот.ВремяНачала;
        НоваяСтрока.Оборудование = СтрокаГорныхРабот.Оборудование;
        НоваяСтрока.Номенклатура = СтрокаГорныхРабот.Номенклатура;
        НоваяСтрока.ЕдиницаИзмерения = СтрокаГорныхРабот.ЕдиницаИзмерения;
        // Поле "Норма по плану" из горных работ не переносим, 
        // так как в приемке должно быть "Фактически выполнено"
        // Оставляем его пустым для заполнения пользователем
    КонецЦикла;
КонецПроцедуры     

&НаСервере
Функция ПолучитьДанныеГорныхРабот(СсылкаГорныеРаботы)
    
    Если Не ЗначениеЗаполнено(СсылкаГорныеРаботы) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем данные горных работ
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ГорныеРаботыРаботы.ВремяНачала,
    |    ГорныеРаботыРаботы.Оборудование,
    |    ГорныеРаботыРаботы.Номенклатура,
    |    ГорныеРаботыРаботы.ЕдиницаИзмерения
    |ИЗ
    |    Документ.ГорныеРаботы.Работы КАК ГорныеРаботыРаботы
    |ГДЕ
    |    ГорныеРаботыРаботы.Ссылка = &СсылкаГорныхРабот";
    
    Запрос.УстановитьПараметр("СсылкаГорныхРабот", СсылкаГорныеРаботы);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    МассивДанных = Новый Массив;
    
    Пока Выборка.Следующий() Цикл
        // Создаем структуру для каждой строки
        СтрокаДанных = Новый Структура;
        СтрокаДанных.Вставить("ВремяНачала", Выборка.ВремяНачала);
        СтрокаДанных.Вставить("Оборудование", Выборка.Оборудование);
        СтрокаДанных.Вставить("Номенклатура", Выборка.Номенклатура);
        СтрокаДанных.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
        
        МассивДанных.Добавить(СтрокаДанных);
    КонецЦикла;
    
    Возврат МассивДанных;
    
КонецФункции
